index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Equal Rights for Functional Objects</title>
<meta name="author" content="(Henry Baker)"/>
<link rel="stylesheet" href="./css/reveal.min.css"/>
<link rel="stylesheet" href="./css/theme/simple.css" id="theme"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>Equal Rights for Functional Objects</h1>
<h2>Henry Baker</h2>
<h2><a href="mailto:Philip Potter - @philandstuff">Philip Potter - @philandstuff</a></h2>
<h2></h2></section>
<section>
<h2>Table of Contents</h2><ul>
<li>
<a href="#sec-1">introduction</a>
</li>
<li>
<a href="#sec-2">problem: many types of equality</a>
<ul>
<li>
<a href="#sec-2-1">oops</a>
</li>
<li>
<a href="#sec-2-2">oops</a>
</li>
<li>
<a href="#sec-2-3">lists</a>
</li>
<li>
<a href="#sec-2-4">in java.util.List terms&#x2026;</a>
</li>
</ul>
<li>
<a href="#sec-3">object identity</a>
</li>
<li>
<a href="#sec-4">what do we really want from equality?</a>
<ul>
<li>
<a href="#sec-4-1">ONE equality operator!</a>
</li>
<li>
<a href="#sec-4-2">equivalence relation</a>
</li>
<li>
<a href="#sec-4-3">not too fine, not too coarse</a>
</li>
</ul>
<li>
<a href="#sec-5">solution: egal</a>
<ul>
<li>
<a href="#sec-5-1">numbers</a>
</li>
<li>
<a href="#sec-5-2">immutable lists</a>
</li>
<li>
<a href="#sec-5-3">mutable lists</a>
</li>
<li>
<a href="#sec-5-4">mutable lists</a>
</li>
<li>
<a href="#sec-5-5">in summary:</a>
</li>
</ul>
<li>
<a href="#sec-6">implications</a>
<ul>
<li>
<a href="#sec-6-1">immutability matters</a>
</li>
<li>
<a href="#sec-6-2">mutable lists &amp; sets are rubbish</a>
</li>
<li>
<a href="#sec-6-3">mutable objects should store a single value</a>
</li>
<li>
<a href="#sec-6-4">distributed systems</a>
</li>
</ul>
<li>
<a href="#sec-7">questions for discussion</a>
<ul>
<li>
<a href="#sec-7-1">reference equality isn't perfect for mutable objects</a>
</li>
<li>
<a href="#sec-7-2">laziness</a>
</li>
<li>
<a href="#sec-7-3">what about functions?</a>
</li>
<li>
<a href="#sec-7-4">abstract data types &amp; user-defined equality</a>
</li>
<li>
<a href="#sec-7-5">internally mutable fields</a>
</li>
<li>
<a href="#sec-7-6">closures and data defined using them</a>
<ul>
<li>
<a href="#sec-7-6-1">applies equally to anonymous inner classes</a>
</li>
</ul>
<li>
<a href="#sec-8">fin</a>
</li>
</ul>
</section>

<section>
<section id="sec-1" >

<h2>introduction</h2>
<p class="fragment">
The Joy of Clojure, Michael Fogus and Chris Houser
</p>

<p class="fragment">
<i>And if two objects aren't equal forever, then they're technically
never equal (Baker 1993).</i>
</p>
</section>

</section>
<section>
<section id="sec-2" >

<h2>problem: many types of equality</h2>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides" class="reveal">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C++</td>
<td class="left">pointer equality, overloaded <code>==</code> operator</td>
</tr>

<tr>
<td class="left">Lisp</td>
<td class="left"><code>EQ</code>, <code>EQL</code>, <code>EQUAL</code>, <code>EQUALP</code>, <code>STRING=</code>, <code>CHAR=</code>&#x2026;</td>
</tr>

<tr>
<td class="left">Smalltalk</td>
<td class="left"><code>=</code>, <code>==</code></td>
</tr>

<tr>
<td class="left">Java</td>
<td class="left"><code>==</code>, <code>.equals()</code></td>
</tr>

<tr>
<td class="left">Perl</td>
<td class="left"><code>==</code>, <code>eq</code></td>
</tr>

<tr>
<td class="left">Python</td>
<td class="left"><code>==</code>, <code>is</code></td>
</tr>

<tr>
<td class="left">Ruby</td>
<td class="left"><code>==</code>, <code>eql?</code>, <code>equal?</code></td>
</tr>
</tbody>
</table>

</section>
<section id="sec-2-1" >

<h3>oops</h3>
<div class="org-src-container">

<pre  class="src src-python"><span style="color: #b22222;"># </span><span style="color: #b22222;">Python</span>
<span style="color: #a0522d;">x</span> = 1
<span style="color: #a0522d;">y</span> = 1
x <span style="color: #a020f0;">is</span> y
</pre>
</div>

<pre class="example">
True
</pre>

<div class="org-src-container">

<pre  class="src src-python"><span style="color: #a0522d;">x</span> = 500
<span style="color: #a0522d;">y</span> = 500
x <span style="color: #a020f0;">is</span> y
</pre>
</div>

<pre class="example">
False
</pre>

</section>
<section id="sec-2-2" >

<h3>oops</h3>
<div class="org-src-container">

<pre  class="src src-java"><span style="color: #a020f0;">public</span> <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Foo</span> {
    <span style="color: #a020f0;">public</span> <span style="color: #a020f0;">static</span> <span style="color: #228b22;">void</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">String</span>[] <span style="color: #a0522d;">args</span>) {
        <span style="color: #a020f0;">if</span> (Integer.valueOf(200) == Integer.valueOf(200)) {
            System.out.println(<span style="color: #8b2252;">"Hooray!"</span>);
        } <span style="color: #a020f0;">else</span> {
            System.out.println(<span style="color: #8b2252;">"Oh noes!"</span>);
        }
    }
}
</pre>
</div>

<pre class="example">
Oh noes!
</pre>

</section>
<section id="sec-2-3" >

<h3>lists</h3>
<p>
if x = <code>[1,2,3]</code>, and y = <code>[1,2,3]</code>:
</p>

<p>
are they equal?
</p>

<p>
are they the same?
</p>

<p class="fragment">
can we answer this without resorting to "it depends"?
</p>

</section>
<section id="sec-2-4" >

<h3>in java.util.List terms&#x2026;</h3>
<ul class="org-ul">
<li><code>==</code> is sometimes too fine
</li>
<li><code>.equals()</code> is sometimes too coarse
</li>
</ul>
</section>


</section>
<section>
<section id="sec-3" >

<h2>object identity</h2>
<div class="org-src-container">

<pre  class="fragment">sugababes = <span style="color: #228b22;">Set</span>.new [<span style="color: #008b8b;">:mutya</span>, <span style="color: #008b8b;">:keisha</span>, <span style="color: #008b8b;">:siobhan</span>]
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment">sugababes.delete(<span style="color: #008b8b;">:siobhan</span>); sugababes.add(<span style="color: #008b8b;">:heidi</span>) <span style="color: #b22222;"># </span><span style="color: #b22222;">2001</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment">sugababes.delete(<span style="color: #008b8b;">:mutya</span>); sugababes.add(<span style="color: #008b8b;">:amelle</span>) <span style="color: #b22222;"># </span><span style="color: #b22222;">2005</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment">sugababes.delete(<span style="color: #008b8b;">:keisha</span>); sugababes.add(<span style="color: #008b8b;">:jade</span>) <span style="color: #b22222;"># </span><span style="color: #b22222;">2009</span>
</pre>
</div>

<div class="org-src-container">

<pre  class="fragment">new_band = <span style="color: #228b22;">Set</span>.new [<span style="color: #008b8b;">:mutya</span>, <span style="color: #008b8b;">:keisha</span>, <span style="color: #008b8b;">:siobhan</span>] <span style="color: #b22222;"># </span><span style="color: #b22222;">2011</span>
</pre>
</div>
</section>

</section>
<section>
<section id="sec-4" >

<h2>what do we really want from equality?</h2>
</section>
<section id="sec-4-1" >

<h3>ONE equality operator!</h3>

</section>
<section id="sec-4-2" >

<h3>equivalence relation</h3>
<p>
reflexive:
</p>

<p>
$$ a \equiv a $$
</p>

<p>
symmetric:
</p>

<p>
$$ a \equiv b \implies b \equiv a $$
</p>

<p>
transitive:
</p>

<p>
$$ a \equiv b \land b \equiv c \implies a \equiv c $$
</p>

<p>
Partitions the universe into <i>equivalence classes</i>
</p>

</section>
<section>

<p>
\(x \equiv y \implies f(x) \equiv f(y)\)
</p>

<p>
for arbitrary \(f\)
</p>

</section>
<section id="sec-4-3" >

<h3>not too fine, not too coarse</h3>
</section>

</section>
<section>
<section id="sec-5" >

<h2>solution: egal</h2>
<p>
Key idea is that of object identity:
</p>

<p>
Objects which <i>behave</i> the same should <i>be</i> the same.
</p>

<p class="fragment">
Related to "identity of indiscernibles"
</p>

</section>
<section id="sec-5-1" >

<h3>numbers</h3>
<p>
500 = 500
</p>

</section>
<section id="sec-5-2" >

<h3>immutable lists</h3>
<p>
[1,2,3] = [1,2,3]
</p>

<p class="fragment">
[a,b,c] = [a,b,c]
</p>

<p class="fragment">
more generally, iterate over elements and recursively call egal
</p>

</section>
<section id="sec-5-3" >

<h3>mutable lists</h3>
<p>
[1,2,3] = [1,2,3]?
</p>

</section>
<section id="sec-5-4" >

<h3>mutable lists</h3>
<p>
compare <code>eq-cons</code> on p3 of the paper
</p>

<div class="org-src-container">

<pre  class="src src-ruby"><span style="color: #a020f0;">def</span> <span style="color: #0000ff;">same?</span>(x,y)
  saved_head = x[0]
  x[0] = <span style="color: #8b2252;">"My super-sekrit value"</span>
  x[0] == y[0]
<span style="color: #a020f0;">ensure</span>
  x[0] = saved_head
<span style="color: #a020f0;">end</span>

x = [<span style="color: #8b2252;">"a"</span>]; y = [<span style="color: #8b2252;">"a"</span>]

puts <span style="color: #8b2252;">"x=x:</span><span style="color: #a0522d;"> #{same?(x,x)}</span><span style="color: #8b2252;">"</span>
puts <span style="color: #8b2252;">"x=y:</span><span style="color: #a0522d;"> #{same?(x,y)}</span><span style="color: #8b2252;">"</span>
</pre>
</div>

<pre class="example">
x=x: true
x=y: false
</pre>

</section>
<section id="sec-5-5" >

<h3>in summary:</h3>
<p>
compare simple values by value
</p>

<p>
compare <b>mutable</b> objects by reference
</p>

<p>
compare <b>immutable</b> objects by recursively comparing their components
</p>
</section>

</section>
<section>
<section id="sec-6" >

<h2>implications</h2>
</section>
<section id="sec-6-1" >

<h3>immutability matters</h3>
<aside class="notes">
<p>
immutable views on mutable objects don't cut it
</p>
</aside>

</section>
<section id="sec-6-2" >

<h3>mutable lists &amp; sets are rubbish</h3>

</section>
<section id="sec-6-3" >

<h3>mutable objects should store a single value</h3>
<aside class="notes">
<p>
It's too valuable to be able to compare lists and maps by value, that
you want to use immutable values all the time.  Rather than using a
mutable list, use a mutable cell containing an immutable list.
</p>
</aside>

</section>
<section id="sec-6-4" >

<h3>distributed systems</h3>
</section>

</section>
<section>
<section id="sec-7" >

<h2>questions for discussion</h2>
</section>
<section id="sec-7-1" >

<h3>reference equality isn't perfect for mutable objects</h3>
<aside class="notes">
<p>
conflict: can't have reference equality and the ability to simulate other objects
</p>
</aside>

</section>
<section id="sec-7-2" >

<h3>laziness</h3>
<div class="org-src-container">

<pre  class="src src-clojure"><span style="color: #b22222;">;; </span><span style="color: #b22222;">clojure</span>
(<span style="color: #483d8b;">=</span> (<span style="color: #483d8b;">iterate</span> inc 1) (<span style="color: #483d8b;">iterate</span> inc 1))
</pre>
</div>

<div class="org-src-container">

<pre  class="src src-haskell"><span style="color: #b22222;">-- </span><span style="color: #b22222;">haskell</span>
<span style="color: #0000ff;">cycle</span> [1] <span style="color: #a0522d;">==</span> cycle [1]
</pre>
</div>

</section>
<section id="sec-7-3" >

<h3>what about functions?</h3>
<p>
functions are values too.  can we compare functions?  should we?
</p>

</section>
<section id="sec-7-4" >

<h3>abstract data types &amp; user-defined equality</h3>
</section>
<section id="sec-7-5" >

<h3>internally mutable fields</h3>
<p>
for example: cached hashcode field as a performance optimization
</p>

</section>
<section id="sec-7-6" >

<h3>closures and data defined using them</h3>
</section>
<section id="sec-7-6-1" >

<h4>applies equally to anonymous inner classes</h4>
</section>

</section>
<section>
<section id="sec-8" >

<h2>fin</h2>
</section>
</section>
</div>
</div>
<script src="./lib/js/head.min.js"></script>
<script src="./js/reveal.min.js"></script>
<script>

        		// Full list of configuration options available here:
        		// https://github.com/hakimel/reveal.js#configuration
        		Reveal.initialize({
        			controls: true,
        			progress: true,
        			history: true,
        			center: true,
                                slideNumber: true,
        			rollingLinks: false,
        			keyboard: true,
        			overview: true,
        			 // slide width
        			 // slide height
        			 // slide margin
        			minScale: 1.20, // slide minimum scaling factor
        			maxScale: 1.20, // slide maximum scaling factor


        			theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
        			transition: Reveal.getQueryHash().transition || 'linear', // default/cube/page/concave/zoom/linear/fade/none
        			transitionSpeed: 'default',

        			// Optional libraries used to extend on reveal.js
        			dependencies: [
        				{ src: './lib/js/classList.js', condition: function() { return !document.body.classList; } }
        				,{ src: './plugin/markdown/showdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } }
        				,{ src: './plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } }
        				,{ src: './plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }
        				,{ src: './plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } }
        				,{ src: './plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: './plugin/search/search.js', async: true, condition: function() { return !!document.body.classList; } }
        				// { src: './plugin/remotes/remotes.js', async: true, condition: function() { return !!document.body.classList; } }
         				
        			]
        		});
</script>
</body>
</html>
